package software.analysis.nju.util

import scala.collection.mutable

object CourtInfo {

 private val courtMap = Map("市高级法院" -> "200", "一中院" -> "210", "二中院" ->"220", "海事法院" -> "230",
                                  "和平区法院" -> "211", "南开区法院" -> "212", "河西区法院" -> "222",
                                  "河东区法院" -> "221", "河北区法院" -> "213", "红桥区法院" -> "214",
                                  "滨海新区法院" -> "22A", "塘沽审判区" -> "223", "汉沽审判区" -> "224",
                                  "大港审判区" -> "225", "功能区审判区" -> "229", "东丽区法院" -> "226",
                                  "津南区法院" -> "227", "西青区法院" -> "215", "北辰区法院" -> "216",
                                  "武清区法院" -> "217", "宝坻区法院" -> "219", "静海区法院" -> "218",
                                  "宁河县法院" -> "228", "蓟县法院" -> "21A", "铁路法院" -> "132")
private val courtMap2 = Map("市高级法院" -> "200")
  def getCourtMap: Map[String, String] = courtMap2
}
